In [1]:
import pandas as pd

#### country:国
#### element:小麦の収穫面積
#### unit:単位
#### value:値

In [2]:
df = pd.read_csv("data/wheat.csv", sep=",")
display(df.head())
print(df.shape)

       Country         Element    Unit      Value
0  Afghanistan  Area harvested      ha  1635000.0
1  Afghanistan           Yield   hg/ha    22100.0
2  Afghanistan      Production  tonnes  3613300.0
3      Albania  Area harvested      ha    65072.0
4      Albania           Yield   hg/ha    36927.0

(369, 4)

In [3]:
df_prod = df[df["Element"]=="Production"] 
display(df_prod.head())

        Country     Element    Unit       Value
2   Afghanistan  Production  tonnes   3613300.0
5       Albania  Production  tonnes    240294.0
8       Algeria  Production  tonnes   3981219.0
11       Angola  Production  tonnes      2820.0
14    Argentina  Production  tonnes  18518045.0

In [4]:
print(int(df_prod["Value"].mean().round(0)))

5967902

In [5]:
df_prod_sort = df_prod.sort_values(by="Value", ascending=False).reset_index(drop=True)
display(df_prod_sort.head(10))

                    Country     Element    Unit        Value
0                     China  Production  tonnes  131447224.0
1                     India  Production  tonnes   99700000.0
2        Russian Federation  Production  tonnes   72136149.0
3  United States of America  Production  tonnes   51286540.0
4                    France  Production  tonnes   35798234.0
5                    Canada  Production  tonnes   31769200.0
6                  Pakistan  Production  tonnes   25076149.0
7                   Ukraine  Production  tonnes   24652840.0
8                 Australia  Production  tonnes   20941134.0
9                   Germany  Production  tonnes   20263500.0

In [6]:
display(df_prod_sort[df_prod_sort["Country"]=="Japan"])

   Country     Element    Unit     Value
52   Japan  Production  tonnes  764900.0

In [7]:
df_prod_sort = df_prod_sort.drop(columns="Element")
display(df_prod_sort.head())

                    Country    Unit        Value
0                     China  tonnes  131447224.0
1                     India  tonnes   99700000.0
2        Russian Federation  tonnes   72136149.0
3  United States of America  tonnes   51286540.0
4                    France  tonnes   35798234.0

In [8]:
df.to_csv( "data/wheat_prod_sort.csv", index=False, encoding="utf-8-sig")